Repository: giellalt/corpus-sme
Catalog: tmx/eng/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=15_lang=davvi.html.tmx
Source language: sme
Languages: eng

source: Sámedikki buvttadan dieđihanmáteriala.
eng: Broshures produced by Sámi Parliament.

source: Dieđihančállosiid sáhttá diŋgot Sámedikki Anára doaibmabáikkis.
eng: Orders to the Sámi Parliaments office in Inari.

source: Sámediggi
eng: Saami Parliament

source: Sámekulturguovddáš
eng: The Sámi Cultural Centre

source: Sámit Suomas
eng: The Sámi in Finland
